* 2017
** 2017-08 August
*** 2017-08-18 Friday
**** COST put
     |----+------+----------------------------+------------------|
     | -1 |  140 | put                        | <2017-08-18 Fri> |
     | -1 |  145 | put                        | <2017-08-18 Fri> |
     | -2 |  150 | put                        | <2017-08-18 Fri> |
     |----+------+----------------------------+------------------|
     |    | 1.43 | jul 153-put                | <2017-06-22 Thu> |
     |    | 2.17 | 2 * jul 150-puts           | <2017-06-23 Fri> |
     |    | 0.78 | aug 145-put                | <2017-07-05 Wed> |
     |    | 0.66 | aug 140-put                | <2017-07-07 Fri> |
     |    | 1.52 | aug 150-put                | <2017-07-05 Wed> |
     |    | 0.70 | jul 153-put -> aug 150-put | <2017-07-12 Wed> |
     |----+------+----------------------------+------------------|
     |    | 7.26 |                            |                  |
     |----+------+----------------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** ED put
     |----+------+-------+------------------|
     | -1 |   80 | put   | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.85 | trade | <2017-06-27 Tue> |
     |----+------+-------+------------------|
     |    | 0.85 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** FXE strangle
     |----+------+-------------------+------------------|
     | -1 |  108 | put               | <2017-08-18 Fri> |
     | -1 |  113 | call              | <2017-09-15 Fri> |
     |----+------+-------------------+------------------|
     |    | 0.38 | trade             | <2017-07-13 Thu> |
     |    | 0.56 | 113-call aug->sep | <2017-08-04 Fri> |
     |----+------+-------------------+------------------|
     |    | 0.94 |                   |                  |
     |----+------+-------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HTZ call
     |----+------+-------+------------------|
     | -1 | 17.5 | call  | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.75 | trade | <2017-07-13 Thu> |
     |----+------+-------+------------------|
     |    | 0.75 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HTZ call spread
     |----+------+-------+------------------|
     | -1 | 12.5 | call  | <2017-08-18 Fri> |
     |  1 |   15 | call  | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.53 | trade | <2017-06-28 Wed> |
     |----+------+-------+------------------|
     |    | 0.53 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** ICE call
     |----+------+---------------+------------------|
     | -1 |   65 | call          | <2017-08-18 Fri> |
     |----+------+---------------+------------------|
     |    | 0.45 | trade         | <2017-06-07 Wed> |
     |    | 0.92 | roll jul->aug | <2017-07-14 Fri> |
     |----+------+---------------+------------------|
     |    | 1.37 |               |                  |
     |----+------+---------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** JCI put
     |----+------+-------+------------------|
     | -1 |   28 | put   | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.49 | trade | <2017-07-27 Thu> |
     |----+------+-------+------------------|
     |    | 0.49 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** JCI strangle
     |----+------+-------+------------------|
     | -1 |   42 | put   | <2017-08-18 Fri> |
     | -1 |   45 | call  | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.85 | trade | <2017-07-26 Wed> |
     |----+------+-------+------------------|
     |    | 0.85 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** MCD put
     |----+------+-------------+------------------|
     | -1 |  145 | put         | <2017-08-18 Fri> |
     |----+------+-------------+------------------|
     |    | 1.00 | aug 145-put | <2017-06-29 Thu> |
     |----+------+-------------+------------------|
     |    | 1.00 |             |                  |
     |----+------+-------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** NAT put
     |----+------+----------+------------------|
     | -2 |    7 | put      | <2017-08-18 Fri> |
     |----+------+----------+------------------|
     |    | 0.80 | trade    | <2017-05-16 Tue> |
     |    | 0.20 | jun->jul | <2017-06-12 Mon> |
     |    | 0.60 | jul->aug | <2017-07-06 Thu> |
     |----+------+----------+------------------|
     |    | 1.60 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** NVDA put spread
     |----+------+-------+------------------|
     |  1 |  145 | put   | <2017-08-18 Fri> |
     | -1 |  148 | put   | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.52 | trade | <2017-08-03 Thu> |
     |----+------+-------+------------------|
     |    | 0.52 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** QQQ calls
     |----+------+------------------------------+------------------|
     | -1 |  136 | call                         | <2017-08-18 Fri> |
     | -1 |  137 | call                         | <2017-08-18 Fri> |
     |----+------+------------------------------+------------------|
     |    | 1.23 | may 134-call                 | <2017-04-20 Thu> |
     |    | 1.50 | jun 135-call                 | <2017-04-20 Thu> |
     |    | 0.79 | may 134-call -> jun 134-call | <2017-05-03 Wed> |
     |    | 0.16 | jun 134-call -> aug 136-call | <2017-05-17 Wed> |
     |    | 0.35 | jun 135-call -> aug 137-call | <2017-05-17 Wed> |
     |----+------+------------------------------+------------------|
     |    | 4.03 |                              |                  |
     |----+------+------------------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** QQQ put
     |----+------+-------+------------------|
     | -1 |  134 | put   | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.38 | trade | <2017-07-27 Thu> |
     |----+------+-------+------------------|
     |    | 0.38 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f

**** SLB put
     |----+------+------------------------------+------------------|
     | -1 | 72.5 | put                          | <2017-08-18 Fri> |
     |----+------+------------------------------+------------------|
     |    | 1.51 | jun 72.5-put                 | <2017-04-24 Mon> |
     |    | 0.66 | jun 72.5-put -> jul 72.5-put | <2017-06-09 Fri> |
     |    | 0.20 | jul 72.5-put -> aug 72.5-put | <2017-07-03 Mon> |
     |----+------+------------------------------+------------------|
     |    | 2.37 |                              |                  |
     |----+------+------------------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** XRT jade lizard
     |----+------+-------+------------------|
     | -1 |   38 | put   | <2017-08-18 Fri> |
     | -1 |   40 | call  | <2017-08-18 Fri> |
     |  1 |   41 | call  | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 1.00 | trade | <2017-06-23 Fri> |
     |----+------+-------+------------------|
     |    | 1.00 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-09 September
*** 2017-09-15 Friday
**** AMRN reverse big lizard
     |----+------+-------+------------------|
     |  1 |  2.5 | put   | <2017-09-15 Fri> |
     | -1 |    3 | put   | <2017-09-15 Fri> |
     | -1 |    3 | call  | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.82 | trade | <2017-05-10 Wed> |
     |----+------+-------+------------------|
     |    | 0.82 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** BP put
     |----+------+-------+------------------|
     | -1 |   35 | put   | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.41 | trade | <2017-08-01 Tue> |
     |----+------+-------+------------------|
     |    | 0.41 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** COST puts
     |----+------+-------------+------------------|
     | -1 |  145 | put         | <2017-09-15 Fri> |
     | -1 |  150 | put         | <2017-09-15 Fri> |
     |----+------+-------------+------------------|
     |    | 2.36 | sep 150-put | <2017-07-25 Tue> |
     |    | 1.35 | sep 145-put | <2017-07-26 Wed> |
     |----+------+-------------+------------------|
     |    | 3.71 |             |                  |
     |----+------+-------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HD
     |----+------+------------------------------+------------------|
     | -1 |  140 | put                          | <2017-08-18 Fri> |
     | -1 |  145 | put                          | <2017-08-18 Fri> |
     | -1 |  150 | call                         | <2017-09-15 Fri> |
     |----+------+------------------------------+------------------|
     |    | 0.88 | apr 148-call                 | <2017-04-03 Mon> |
     |    | 1.45 | apr 148-call -> may 150-call | <2017-04-11 Tue> |
     |    | 1.30 | may 150-call -> jul 150-call | <2017-05-01 Mon> |
     |    | 1.28 | jul 150-call -> aug 150-call | <2017-05-26 Fri> |
     |    | 0.56 | jul 145-put                  | <2017-06-23 Fri> |
     |    | 0.85 | aug 140-put                  | <2017-07-05 Wed> |
     |    | 0.42 | jul 146-put                  | <2017-07-05 Wed> |
     |    | 0.98 | aug 145-put                  | <2017-07-18 Tue> |
     |    | 0.46 | jul 143-put                  | <2017-07-20 Thu> |
     |    | 0.70 | aug 150-call -> sep 150-call | <2017-08-14 Mon> |
     |----+------+------------------------------+------------------|
     |    | 8.88 |                              |                  |
     |----+------+------------------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HES put
     |----+------+-----------------+------------------|
     | -1 |   40 | put             | <2017-09-15 Fri> |
     | -1 |   45 | put             | <2017-08-18 Fri> |
     |----+------+-----------------+------------------|
     |    | 0.84 | 40-put trade    | <2017-08-01 Tue> |
     |    | 0.68 | 45-put trade    | <2017-05-23 Tue> |
     |    | 0.99 | 45-put jun->jul | <2017-06-16 Fri> |
     |    | 0.90 | 45-put jul->aug | <2017-07-13 Thu> |
     |    | 0.85 | 45-put aug->sep | <2017-08-04 Fri> |
     |----+------+-----------------+------------------|
     |    | 4.26 |                 |                  |
     |----+------+-----------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** ICE call
     |----+------+-------+------------------|
     | -1 | 67.5 | call  | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.30 | trade | <2017-08-11 Fri> |
     |----+------+-------+------------------|
     |    | 0.30 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** JCI put
     |----+------+-------+------------------|
     | -1 |   38 | put   | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.73 | trade | <2017-07-27 Thu> |
     |----+------+-------+------------------|
     |    | 0.73 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** MCD big lizard
     |----+-------+----------------------+------------------|
     | -1 |   145 | put                  | <2017-07-21 Fri> |
     | -1 |   145 | put                  | <2017-09-15 Fri> |
     | -1 |   145 | call                 | <2017-09-15 Fri> |
     |  1 |   150 | call                 | <2017-09-15 Fri> |
     |----+-------+----------------------+------------------|
     |    |  5.02 | trade                | <2017-05-17 Wed> |
     |    | -0.24 | call spread jul->sep | <2017-05-31 Wed> |
     |    |  2.07 | sep 145-put          | <2017-06-29 Thu> |
     |----+-------+----------------------+------------------|
     |    |  6.85 |                      |                  |
     |----+-------+----------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** MCD put
     |----+------+-------+------------------|
     | -1 |  150 | put   | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 1.54 | trade | <2017-08-01 Tue> |
     |----+------+-------+------------------|
     |    | 1.54 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** MSFT iron condor
     |----+------+-------+------------------|
     |  1 | 67.5 | put   | <2017-09-15 Fri> |
     | -1 |   70 | put   | <2017-09-15 Fri> |
     | -1 | 77.5 | call  | <2017-09-15 Fri> |
     |  1 |   80 | call  | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.58 | trade | <2017-07-27 Thu> |
     |----+------+-------+------------------|
     |    | 0.58 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** QQQ put
     |----+------+---------------+------------------|
     | -1 |  132 | put           | <2017-09-15 Fri> |
     | -1 |  133 | put           | <2017-09-15 Fri> |
     | -1 |  134 | put           | <2017-09-15 Fri> |
     | -1 |  135 | put           | <2017-09-15 Fri> |
     |----+------+---------------+------------------|
     |    | 0.64 | 132-put trade | <2017-08-11 Fri> |
     |    | 0.74 | 133-put trade | <2017-08-11 Fri> |
     |    | 0.51 | 134-put trade | <2017-07-27 Thu> |
     |    | 1.00 | 135-put trade | <2017-08-11 Fri> |
     |----+------+---------------+------------------|
     |    | 2.89 |               |                  |
     |----+------+---------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** SLB put
     |----+------+--------------------------+------------------|
     | -1 |   60 | put                      | <2017-09-15 Fri> |
     | -1 |   70 | put                      | <2017-09-15 Fri> |
     |----+------+--------------------------+------------------|
     |    | 0.89 | jun 70-put               | <2017-04-24 Mon> |
     |    | 1.11 | jun 70-put -> jul 70-put | <2017-06-09 Fri> |
     |    | 0.35 | jul 70-put -> aug 70-put | <2017-07-06 Thu> |
     |    | 0.58 | sep 60-put               | <2017-08-11 Fri> |
     |    | 0.50 | aug 70-put -> sep 70-put | <2017-08-14 Mon> |
     |----+------+--------------------------+------------------|
     |    | 3.43 |                          |                  |
     |----+------+--------------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** SO put
     |----+------+-------+------------------|
     | -1 |   48 | put   | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.52 | trade | <2017-08-03 Thu> |
     |----+------+-------+------------------|
     |    | 0.52 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** TEVA put
     |----+------+-------+------------------|
     | -1 |   20 | put   | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.86 | trade | <2017-08-04 Fri> |
     |----+------+-------+------------------|
     |    | 0.86 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** V put
     |----+------+-------+------------------|
     | -1 |   95 | put   | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.43 | trade | <2017-08-03 Thu> |
     |----+------+-------+------------------|
     |    | 0.43 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** WMT big lizard
     |----+------+------------------------+------------------|
     | -2 | 77.5 | put                    | <2017-09-15 Fri> |
     | -2 | 77.5 | call                   | <2017-09-15 Fri> |
     |  2 |   80 | call                   | <2017-09-15 Fri> |
     |----+------+------------------------+------------------|
     |    | 4.24 | sep 77.5/80 big-lizard | <2017-05-10 Wed> |
     |    | 4.11 | sep 77.5/80 big-lizard | <2017-06-27 Tue> |
     |----+------+------------------------+------------------|
     |    | 8.35 |                        |                  |
     |----+------+------------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-10 October
*** 2017-10-20 Friday
**** BP put
     |----+------+-------+------------------|
     | -1 |   34 | put   | <2017-10-20 Fri> |
     |----+------+-------+------------------|
     |    | 0.61 | trade | <2017-08-11 Fri> |
     |----+------+-------+------------------|
     |    | 0.61 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** COST put
     |----+------+-------+------------------|
     | -1 |  150 | put   | <2017-10-20 Fri> |
     |----+------+-------+------------------|
     |    | 2.43 | trade | <2017-08-03 Thu> |
     |----+------+-------+------------------|
     |    | 2.43 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HTZ put
     |----+------+----------+------------------|
     | -1 |   45 | put      | <2017-10-20 Fri> |
     |----+------+----------+------------------|
     |    | 0.51 | trade    | <2017-03-13 Mon> |
     |    | 0.16 | apr->may | <2017-04-10 Mon> |
     |    | 0.45 | may->jul | <2017-04-24 Mon> |
     |    | 0.15 | jul->oct | <2017-07-07 Fri> |
     |----+------+----------+------------------|
     |    | 1.27 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** STO put
     |----+------+-------+------------------|
     | -1 | 17.5 | put   | <2017-10-20 Fri> |
     |----+------+-------+------------------|
     |    | 0.30 | trade | <2017-08-01 Tue> |
     |----+------+-------+------------------|
     |    | 0.30 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-11 November
*** 2017-11-17 Friday
**** CAT call
     |----+------+----------------+------------------|
     | -2 |  100 | call           | <2017-11-17 Fri> |
     |----+------+----------------+------------------|
     |    | 2.28 | apr 98.5-calls | <2017-04-24 Mon> |
     |    | 1.02 | apr->jul       | <2017-04-26 Wed> |
     |    | 0.68 | jun 92.5-put   | <2017-05-05 Fri> |
     |    | 0.49 | jul 95-put     | <2017-06-06 Tue> |
     |    | 0.50 | jul 102-put    | <2017-07-06 Thu> |
     |    | 1.24 | jul->aug       | <2017-07-03 Mon> |
     |    | 3.56 | aug->nov       | <2017-07-17 Mon> |
     |----+------+----------------+------------------|
     |    | 9.77 |                |                  |
     |----+------+----------------+------------------|
      #+TBLFM: @>$2=vsum(@II..III);%.2f
**** ED call
     |----+------+----------+------------------|
     | -1 |   80 | call     | <2017-11-17 Fri> |
     |----+------+----------+------------------|
     |    | 0.58 | trade    | <2017-05-10 Wed> |
     |    | 0.34 | 75 put   | <2017-05-10 Wed> |
     |    | 0.50 | jun->jul | <2017-06-06 Tue> |
     |    | 0.61 | jul->aug | <2017-07-03 Mon> |
     |    | 0.61 | aug->nov | <2017-08-09 Wed> |
     |----+------+----------+------------------|
     |    | 2.64 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-12 December
*** 2017-12-15 Friday
**** ICE call
     |----+------+-------+------------------|
     | -1 |   70 | call  | <2017-12-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.85 | trade | <2017-06-07 Wed> |
     |----+------+-------+------------------|
     |    | 0.85 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** MCD call
     |----+------+-----------------------+------------------|
     | -1 |  135 | call                  | <2017-12-15 Fri> |
     |----+------+-----------------------+------------------|
     |    | 1.55 | trade                 | <2017-04-06 Thu> |
     |    | 1.88 | put 125->141          | <2017-04-28 Fri> |
     |    | 3.16 | may->jun put 141->145 | <2017-05-04 Thu> |
     |    | 1.12 | jun->dec              | <2017-05-31 Wed> |
     |----+------+-----------------------+------------------|
     |    | 7.71 |                       |                  |
     |----+------+-----------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
* 2018
** 2018-01 January
*** 2017-01-19 Friday
**** OIH ratio put spread
     |----+------+----------+------------------|
     | -2 |   27 | put      | <2018-01-19 Fri> |
     | -1 |   28 | put      | <2018-01-19 Fri> |
     |----+------+----------+------------------|
     |    | 0.19 | trade    | <2017-04-28 Fri> |
     |    | 0.35 | jun->jul | <2017-06-17 Sat> |
     |    | 0.26 | jul->aug | <2017-07-19 Wed> |
     |    | 0.99 | aug->jan | <2017-08-14 Mon> |
     |----+------+----------+------------------|
     |    | 1.79 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** WMT call
     |----+------+--------------------------------+------------------|
     | -2 | 72.5 | call                           | <2018-01-19 Fri> |
     |----+------+--------------------------------+------------------|
     |    | 0.04 | 2 * apr 72.5-call              | <2017-03-27 Mon> |
     |    | 0.80 | apr 72.5-call -> may 72.5-call | <2017-04-12 Wed> |
     |    | 0.59 | may 72.5-call -> jun 72.5-call | <2017-04-24 Mon> |
     |    | 1.58 | jun 72.5-call -> sep 72.5-call | <2017-05-10 Wed> |
     |    | 0.32 | 2 * jul 72.5-put               | <2017-07-07 Fri> |
     |    | 1.36 | sep 72.5-call -> jan 72.5-call | <2017-08-08 Tue> |
     |----+------+--------------------------------+------------------|
     |    | 4.69 |                                |                  |
     |----+------+--------------------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
